# Mac App Store CLI (for Xcode, etc.)
brew "mas"

# =============================================================================
# Core CLI Tools
# =============================================================================
brew "chezmoi"           # dotfiles manager
brew "age"               # encryption for secrets
brew "zsh"
brew "git"
brew "neovim"
# brew "tmux"            # legacy (replaced by zellij)
brew "wget"
brew "curl"
brew "jq"
brew "tree"
brew "colordiff"

# =============================================================================
# Navigation & Search
# =============================================================================
brew "fzf"               # fuzzy finder
brew "peco"              # interactive filtering tool
brew "ghq"               # remote repository management

# =============================================================================
# Development Tools
# =============================================================================
brew "go"
brew "pyenv"
brew "nodebrew"
brew "gh"                # GitHub CLI

# =============================================================================
# Cloud CLI Tools
# =============================================================================
brew "awscli"            # AWS Command Line Interface
cask "gcloud-cli"        # Google Cloud CLI (renamed from google-cloud-sdk)

# =============================================================================
# Infrastructure as Code
# =============================================================================
brew "terraform"         # Infrastructure as Code tool
brew "tflint"            # Terraform linter
brew "terraform-docs"    # Auto-generate documentation
brew "tfsec"             # Security scanner
brew "pre-commit"        # Git hooks framework
# Note: checkov is recommended to install via pipx

# =============================================================================
# Database Tools
# =============================================================================
brew "mysql"

# =============================================================================
# Utilities
# =============================================================================
brew "gibo"              # .gitignore boilerplates
brew "openssl"
brew "readline"

# =============================================================================
# Terminal Emulators
# =============================================================================
cask "ghostty"           # Modern GPU-accelerated terminal (primary)
cask "alacritty"         # GPU-accelerated terminal emulator (backup)

# =============================================================================
# Browsers
# =============================================================================
cask "google-chrome"

# =============================================================================
# Communication
# =============================================================================
cask "slack"
cask "discord"

# =============================================================================
# Development - IDEs & Editors
# =============================================================================
cask "visual-studio-code"
cask "jetbrains-toolbox" # Manages WebStorm, IntelliJ, etc.

# =============================================================================
# Development - Containers & Virtualization
# =============================================================================
cask "orbstack"          # Docker & Linux VMs (faster than Docker Desktop)

# =============================================================================
# Productivity
# =============================================================================
cask "alfred"            # Spotlight replacement
cask "clipy"             # Clipboard manager
cask "obsidian"          # Note-taking
cask "dropbox"           # Cloud storage

# =============================================================================
# AI Tools
# =============================================================================
cask "claude"            # Claude Desktop

# =============================================================================
# Entertainment & Gaming
# =============================================================================
cask "steam"             # Gaming platform
# Note: Kindle is not available via Homebrew - install from Mac App Store

# =============================================================================
# Fonts
# =============================================================================
cask "font-hackgen-nerd" # HackGen Nerd Font (for terminal)

# =============================================================================
# Mac App Store Apps (requires `mas signin` first)
# =============================================================================
# To find app IDs: mas search <app_name>
# mas "Xcode", id: 497799835         # Install manually - very large
mas "Kindle", id: 302584613
