# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# =============================================================================
# Core CLI Tools
# =============================================================================
brew "zsh"
brew "git"
brew "neovim"
brew "zellij"            # modern terminal multiplexer
# brew "tmux"            # legacy (replaced by zellij)
brew "wget"
brew "curl"
brew "jq"
brew "tree"
brew "colordiff"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"               # modern ls replacement

# =============================================================================
# Navigation & Search (zoxide, fzf, ghq)
# =============================================================================
brew "zoxide"            # smarter cd command
brew "fzf"               # fuzzy finder
brew "ghq"               # remote repository management

# =============================================================================
# Development Tools
# =============================================================================
brew "go"
brew "pyenv"
brew "nodebrew"
brew "gh"                # GitHub CLI

# =============================================================================
# Database Tools
# =============================================================================
brew "mysql"

# =============================================================================
# Shell Plugin Manager
# =============================================================================
brew "sheldon"           # fast shell plugin manager

# =============================================================================
# Utilities
# =============================================================================
brew "gibo"              # .gitignore boilerplates
brew "openssl"
brew "readline"

# =============================================================================
# Terminal
# =============================================================================
cask "alacritty"         # GPU-accelerated terminal emulator

# =============================================================================
# Cask Applications (optional, uncomment as needed)
# =============================================================================
# cask "iterm2"
# cask "visual-studio-code"
# cask "google-chrome"
# cask "slack"
# cask "docker"
# cask "1password"

# =============================================================================
# Fonts
# =============================================================================
# cask "font-hack-nerd-font"
# cask "font-jetbrains-mono-nerd-font"
